In [4]:
# Add the Pandas dependency.
import pandas as pd

In [5]:
# Files to load
student_data_to_load = "Resources/students_complete.csv"

# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head() ## <-- .head() displays top 5 rows

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,3694,Melissa Dyer,F,12th,Figueroa High School,99,99
1,4269,Michael Stein Jr.,M,12th,Figueroa High School,99,99
2,6372,Brandon Francis,M,10th,Shelton High School,99,99
3,7117,Carol Robinson,F,10th,Shelton High School,99,99
4,7955,Jennifer Morris,F,9th,Hernandez High School,99,99